推荐系统实践.org
#+TITLE: 推荐系统实践
#+AUTHOR: wyj
#+EMAIL: rs@whu.edu.cn
#+KEYWORDS: notes, data mining
#+OPTIONS: H:3 toc:t ^:{}
#+STYLE: <link rel="stylesheet" type="text/css" href="./style/style.css" />

* 第1章 好的推荐系统
** 什么是推荐系统
   1) 社会化推荐
   2) 基于内容的推荐
   3) 基于协同过滤的推荐
   *推荐算法的本质是通过一定的方式将用户和物品联系起来*
** 个性化推荐系统的应用
   几乎所有的推荐系统应用都是由前台的展示页面、后台的日志系统以及推荐算法系统3部分构成的
*** 电子商务
*** 电影和视频网站
*** 个性化音乐网络电台
*** 社交网络
*** 个性化阅读
*** 基于位置的服务
*** 个性化邮件
*** 个性化广告
    1) 上下文广告：和网页内容相关的广告
    2) 搜索广告：和用户目的相关的广告
    3) 个性化展示广告
** 推荐系统评测
   *预测准确度是推荐系统领域的最重要指标*
   好的推荐系统不仅仅能够准确预测用户的行为，而且能够扩展用户的视野，帮助用户发现那些他们可能会感兴趣，但却不那么容易发现的东西
*** 推荐系统实验方法
**** 离线实验
     步骤：
     1) 通过日志系统获取用户行为数据，并按照一定格式生成一个标准的数据集
     2) 将数据集按照一定的规则分成训练集和测试集
     3) 在训练集上训练用户兴趣模型，在测试集上进行预测
     4) 通过事先定义的离线指标评测算法评测在测试集上的预测结果
     | 优点                       | 缺点                             |
     |----------------------------+----------------------------------|
     | 不需要有对实际系统的控制权 | 无法计算商业上关心的指标         |
     | 不需要用户参与实验         | 离线实验的指标和商业指标存在差距 |
     | 速度快，可以测试大量算法   |                                  |
**** 用户调查
     #+BEGIN_VERSE
     因为上线测试具有较高的风险，所以需要用户调查
     #+END_VERSE
     测试用户的选择：
     1. 尽量保证测试用户的分布和真实用户的分布相同
     2. 尽量保证是双盲实验
     | 优点                               | 缺点                 |
     |------------------------------------+----------------------|
     | 可以获得很多体现用户主观感受的指标 | 招募测试用户代价较大 |
     | 相对在线实验风险很低，出错后易弥补 | 很难组织大规模的测试用户，会使测试结果的统计意义不足 |
**** 在线实验
     *AB测试*
     | 优点                                     | 缺点                                           |
     |------------------------------------------+------------------------------------------------|
     | 可以公平获得不同算法实际在线时的性能指标 | 周期较长，必须进行长期的实验才能得到可靠的结果 |
     要点：
     1. 不会用AB测试测试所有的算法，而只是用它测试那些在离线实验和用户调查中表现很好的算法
     2. 切分流量是AB测试中的关键，不同的层以及控制这些层的团队需要从一个统一的地方获得自己AB测试的流量
     3. 不同层之间的流量应该是正交的
     一般说来，一个新的推荐算法最终上线，需要完成上面所说的3个实验：
     1. 通过离线实验证明它在很多离线指标上优于现有的算法
     2. 通过用户调查确定它的用户满意度不低于现有的算法
     3. 通过在线的AB测试确定它在我们关心的指标上优于现有的算法     
*** 评测指标
**** 用户满意度
     #+BEGIN_VERSE
     是推荐系统的 *最重要指标*
     度量方法：购买率、反馈按钮、点击率、用户停留时间、转化率
     #+END_VERSE    
**** 预测准确度
     #+BEGIN_VERSE
     推荐系统 *离线评测指标* 最重要的指标
     #+END_VERSE
     计算方法：
     1. 需要有一个离线的数据集，该数据集包含用户的历史行为记录
     2. 将该数据集通过时间分成训练集和测试集
     3. 在训练集上建立用户行为和兴趣模型预测用户在测试集上的行为
     4. 计算预测行为和测试集上实际行为的重合度作为预测准确度
***** 评分预测
      均方根误差(RMSE) 平均绝对误差(MAE)
***** TopN推荐(给用户一个个性化的推荐列表)
      准确率(precision) 召回率(recall)
***** 关于评分预测和TopN推荐的讨论
**** 覆盖率
     #+BEGIN_VERSE
     覆盖率描述推荐系统对物品长尾的发掘能力
     覆盖率是一个内容提供商会关心的指标
     用信息熵和基尼系数两个指标来定义覆盖率
     #+END_VERSE
**** 多样性
     #+BEGIN_VERSE
     为了满足用户广泛的兴趣，推荐列表需要能够覆盖用户不同的兴趣领域，即推荐结果需要具有多样性
     多样性描述了推荐列表中物品两两之间的不相似性，因此，多样性和相似性是对应的
     #+END_VERSE
**** 新颖性
     #+BEGIN_VERSE
     新颖性是指给用户推荐那些他们以前没有听过说的物品
     实现新颖性的最简单办法是，把那些用户之前在网站中对其有过行为的物品从推荐列表中过滤掉
     评测新颖度的最简单方法是利用推荐结果的平均流行度，因为越不热门的物品越可能让用户觉得新颖
     #+END_VERSE
