推荐系统实践.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>推荐系统实践</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="推荐系统实践"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-31 20:40:18 CST"/>
<meta name="author" content="wyj"/>
<meta name="description" content=""/>
<meta name="keywords" content="notes, data mining"/>
<link rel="stylesheet" type="text/css" href="./style/style.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">推荐系统实践</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 第1章 好的推荐系统</a>
<ul>
<li><a href="#sec-1-1">1.1 什么是推荐系统</a></li>
<li><a href="#sec-1-2">1.2 个性化推荐系统的应用</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 电子商务</a></li>
<li><a href="#sec-1-2-2">1.2.2 电影和视频网站</a></li>
<li><a href="#sec-1-2-3">1.2.3 个性化音乐网络电台</a></li>
<li><a href="#sec-1-2-4">1.2.4 社交网络</a></li>
<li><a href="#sec-1-2-5">1.2.5 个性化阅读</a></li>
<li><a href="#sec-1-2-6">1.2.6 基于位置的服务</a></li>
<li><a href="#sec-1-2-7">1.2.7 个性化邮件</a></li>
<li><a href="#sec-1-2-8">1.2.8 个性化广告</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 推荐系统评测</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 推荐系统实验方法</a></li>
<li><a href="#sec-1-3-2">1.3.2 评测指标</a></li>
<li><a href="#sec-1-3-3">1.3.3 评测维度</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 第2章 利用用户行为数据</a>
<ul>
<li><a href="#sec-2-1">2.1 用户行为数据简介</a></li>
<li><a href="#sec-2-2">2.2 用户行为分析</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 用户活跃度和物品流行度的分布</a></li>
<li><a href="#sec-2-2-2">2.2.2 用户活跃度和物品流行度的关系</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 实验设计和算法评测</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 数据集</a></li>
<li><a href="#sec-2-3-2">2.3.2 实验设计</a></li>
<li><a href="#sec-2-3-3">2.3.3 评测指标</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 基于邻域的算法</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 基于用户的协同过滤算法</a></li>
<li><a href="#sec-2-4-2">2.4.2 基于物品的协同过滤算法</a></li>
<li><a href="#sec-2-4-3">2.4.3 UserCF和ItemCF的综合比较</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5 隐语义模型</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1 基础算法</a></li>
<li><a href="#sec-2-5-2">2.5.2 基于LFM的实际系统的例子</a></li>
<li><a href="#sec-2-5-3">2.5.3 LFM和基于邻域的方法的比较</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6 基于图的模型</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1 用户行为数据的二分图表示</a></li>
<li><a href="#sec-2-6-2">2.6.2 基于图的推荐算法</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 第3章 推荐系统冷启动问题</a>
<ul>
<li><a href="#sec-3-1">3.1 冷启动问题简介</a></li>
<li><a href="#sec-3-2">3.2 利用用户注册信息</a></li>
<li><a href="#sec-3-3">3.3 选择合适的物品启动用户的兴趣</a></li>
<li><a href="#sec-3-4">3.4 利用物品的内容信息</a></li>
<li><a href="#sec-3-5">3.5 发挥专家的作用</a></li>
</ul>
</li>
<li><a href="#sec-4">4 第4章 利用用户标签数据</a>
<ul>
<li><a href="#sec-4-1">4.1 UGC标签系统的代表应用</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 Delicious</a></li>
<li><a href="#sec-4-1-2">4.1.2 CiteULike</a></li>
<li><a href="#sec-4-1-3">4.1.3 Last.fm</a></li>
<li><a href="#sec-4-1-4">4.1.4 豆瓣</a></li>
<li><a href="#sec-4-1-5">4.1.5 Hulu</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 标签系统中的推荐问题</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 用户为什么进行标注</a></li>
<li><a href="#sec-4-2-2">4.2.2 用户如何打标签</a></li>
<li><a href="#sec-4-2-3">4.2.3 用户打什么样的标签</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 基于标签的推荐系统</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 实验设置</a></li>
<li><a href="#sec-4-3-2">4.3.2 一个最简单的算法</a></li>
<li><a href="#sec-4-3-3">4.3.3 算法的改进</a></li>
<li><a href="#sec-4-3-4">4.3.4 基于图的推荐算法</a></li>
<li><a href="#sec-4-3-5">4.3.5 基于标签的推荐解释</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4 给用户推荐标签</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 为什么要给用户推荐标签</a></li>
<li><a href="#sec-4-4-2">4.4.2 如何给用户推荐标签</a></li>
<li><a href="#sec-4-4-3">4.4.3 实验设置</a></li>
<li><a href="#sec-4-4-4">4.4.4 基于图的标签推荐算法</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5 扩展阅读</a></li>
</ul>
</li>
<li><a href="#sec-5">5 第5章 利用上下文信息</a>
<ul>
<li><a href="#sec-5-1">5.1 时间上下文信息</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 时间效应简介</a></li>
<li><a href="#sec-5-1-2">5.1.2 时间效应举例</a></li>
<li><a href="#sec-5-1-3">5.1.3 系统时间特性的分析</a></li>
<li><a href="#sec-5-1-4">5.1.4 推荐系统的实时性</a></li>
<li><a href="#sec-5-1-5">5.1.5 推荐算法的时间多样性</a></li>
<li><a href="#sec-5-1-6">5.1.6 时间上下文推荐算法</a></li>
<li><a href="#sec-5-1-7">5.1.7 时间段图模型</a></li>
<li><a href="#sec-5-1-8">5.1.8 离线实验</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2 地点上下文信息</a></li>
<li><a href="#sec-5-3">5.3 扩展阅读</a></li>
</ul>
</li>
<li><a href="#sec-6">6 第6章 利用社交网络数据</a>
<ul>
<li><a href="#sec-6-1">6.1 获取社交网络数据的途径</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1 电子邮件</a></li>
<li><a href="#sec-6-1-2">6.1.2 用户注册信息</a></li>
<li><a href="#sec-6-1-3">6.1.3 用户的位置数据</a></li>
<li><a href="#sec-6-1-4">6.1.4 论坛和讨论组</a></li>
<li><a href="#sec-6-1-5">6.1.5 即使聊天工具</a></li>
<li><a href="#sec-6-1-6">6.1.6 社交网站</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2 社交网络数据简介</a></li>
<li><a href="#sec-6-3">6.3 基于社交网络的推荐</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1 基于邻域的社会化推荐算法</a></li>
<li><a href="#sec-6-3-2">6.3.2 基于图的社会化推荐算法</a></li>
<li><a href="#sec-6-3-3">6.3.3 实际系统中的社会化推荐算法</a></li>
<li><a href="#sec-6-3-4">6.3.4 社会化推荐系统和协同过滤推荐系统</a></li>
<li><a href="#sec-6-3-5">6.3.5 信息流推荐</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4 给用户推荐好友</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1 基于内容的匹配</a></li>
<li><a href="#sec-6-4-2">6.4.2 基于共同兴趣的好友推荐</a></li>
<li><a href="#sec-6-4-3">6.4.3 基于社交网络图的好友推荐</a></li>
<li><a href="#sec-6-4-4">6.4.4 基于用户调查的好友推荐算法对比</a></li>
</ul>
</li>
<li><a href="#sec-6-5">6.5 扩展阅读</a></li>
</ul>
</li>
<li><a href="#sec-7">7 第7章 推荐系统实例</a>
<ul>
<li><a href="#sec-7-1">7.1 外围架构</a></li>
<li><a href="#sec-7-2">7.2 推荐系统架构</a></li>
<li><a href="#sec-7-3">7.3 推荐引擎的架构</a>
<ul>
<li><a href="#sec-7-3-1">7.3.1 生成用户特征向量</a></li>
<li><a href="#sec-7-3-2">7.3.2 特征-物品相关推荐</a></li>
<li><a href="#sec-7-3-3">7.3.3 过滤模块</a></li>
<li><a href="#sec-7-3-4">7.3.4 排名模块</a></li>
</ul>
</li>
<li><a href="#sec-7-4">7.4 扩展阅读</a></li>
</ul>
</li>
<li><a href="#sec-8">8 第8章 评分预测问题</a>
<ul>
<li><a href="#sec-8-1">8.1 离线实验方法</a></li>
<li><a href="#sec-8-2">8.2 评分预测算法</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1 平均值</a></li>
<li><a href="#sec-8-2-2">8.2.2 基于邻域的方法</a></li>
<li><a href="#sec-8-2-3">8.2.3 隐语义模型与矩阵分解模型</a></li>
<li><a href="#sec-8-2-4">8.2.4 加入时间信息</a></li>
<li><a href="#sec-8-2-5">8.2.5 模型融合</a></li>
<li><a href="#sec-8-2-6">8.2.6 Netflix Prize的相关实验结果</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 第1章 好的推荐系统</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 什么是推荐系统</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>社会化推荐
</li>
<li>基于内容的推荐
</li>
<li>基于协同过滤的推荐
</li>
</ol>

<p>   <b>推荐算法的本质是通过一定的方式将用户和物品联系起来</b>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 个性化推荐系统的应用</h3>
<div class="outline-text-3" id="text-1-2">

<p>   几乎所有的推荐系统应用都是由前台的展示页面、后台的日志系统以及推荐算法系统3部分构成的
</p>
</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 电子商务</h4>
<div class="outline-text-4" id="text-1-2-1">

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 电影和视频网站</h4>
<div class="outline-text-4" id="text-1-2-2">

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 个性化音乐网络电台</h4>
<div class="outline-text-4" id="text-1-2-3">

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> 社交网络</h4>
<div class="outline-text-4" id="text-1-2-4">

</div>

</div>

<div id="outline-container-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> 个性化阅读</h4>
<div class="outline-text-4" id="text-1-2-5">

</div>

</div>

<div id="outline-container-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> 基于位置的服务</h4>
<div class="outline-text-4" id="text-1-2-6">

</div>

</div>

<div id="outline-container-1-2-7" class="outline-4">
<h4 id="sec-1-2-7"><span class="section-number-4">1.2.7</span> 个性化邮件</h4>
<div class="outline-text-4" id="text-1-2-7">

</div>

</div>

<div id="outline-container-1-2-8" class="outline-4">
<h4 id="sec-1-2-8"><span class="section-number-4">1.2.8</span> 个性化广告</h4>
<div class="outline-text-4" id="text-1-2-8">

<ol>
<li>上下文广告：和网页内容相关的广告
</li>
<li>搜索广告：和用户目的相关的广告
</li>
<li>个性化展示广告
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 推荐系统评测</h3>
<div class="outline-text-3" id="text-1-3">

<p>   <b>预测准确度是推荐系统领域的最重要指标</b>
   好的推荐系统不仅仅能够准确预测用户的行为，而且能够扩展用户的视野，帮助用户发现那些他们可能会感兴趣，但却不那么容易发现的东西
</p>
</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 推荐系统实验方法</h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li id="sec-1-3-1-1">离线实验<br/>
     步骤：
<ol>
<li>通过日志系统获取用户行为数据，并按照一定格式生成一个标准的数据集
</li>
<li>将数据集按照一定的规则分成训练集和测试集
</li>
<li>在训练集上训练用户兴趣模型，在测试集上进行预测
</li>
<li>通过事先定义的离线指标评测算法评测在测试集上的预测结果
</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">优点</th><th scope="col" class="left">缺点</th></tr>
</thead>
<tbody>
<tr><td class="left">不需要有对实际系统的控制权</td><td class="left">无法计算商业上关心的指标</td></tr>
<tr><td class="left">不需要用户参与实验</td><td class="left">离线实验的指标和商业指标存在差距</td></tr>
<tr><td class="left">速度快，可以测试大量算法</td><td class="left"></td></tr>
</tbody>
</table>

</li>
</ul>
<ul>
<li id="sec-1-3-1-2">用户调查<br/>

<p class="verse">
因为上线测试具有较高的风险，所以需要用户调查<br/>
</p>


<p>
     测试用户的选择：
</p><ol>
<li>尽量保证测试用户的分布和真实用户的分布相同
</li>
<li>尽量保证是双盲实验
</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">优点</th><th scope="col" class="left">缺点</th></tr>
</thead>
<tbody>
<tr><td class="left">可以获得很多体现用户主观感受的指标</td><td class="left">招募测试用户代价较大</td></tr>
<tr><td class="left">相对在线实验风险很低，出错后易弥补</td><td class="left">很难组织大规模的测试用户，会使测试结果的统计意义不足</td></tr>
</tbody>
</table>

</li>
</ul>
<ul>
<li id="sec-1-3-1-3">在线实验<br/>
     <b>AB测试</b>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">优点</th><th scope="col" class="left">缺点</th></tr>
</thead>
<tbody>
<tr><td class="left">可以公平获得不同算法实际在线时的性能指标</td><td class="left">周期较长，必须进行长期的实验才能得到可靠的结果</td></tr>
</tbody>
</table>

     要点：
<ol>
<li>不会用AB测试测试所有的算法，而只是用它测试那些在离线实验和用户调查中表现很好的算法
</li>
<li>切分流量是AB测试中的关键，不同的层以及控制这些层的团队需要从一个统一的地方获得自己AB测试的流量
</li>
<li>不同层之间的流量应该是正交的
</li>
</ol>

<p>     一般说来，一个新的推荐算法最终上线，需要完成上面所说的3个实验：
</p><ol>
<li>通过离线实验证明它在很多离线指标上优于现有的算法
</li>
<li>通过用户调查确定它的用户满意度不低于现有的算法
</li>
<li>通过在线的AB测试确定它在我们关心的指标上优于现有的算法     
</li>
</ol>

</li>
</ul>
</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> 评测指标</h4>
<div class="outline-text-4" id="text-1-3-2">

<ul>
<li id="sec-1-3-2-1">用户满意度<br/>

<p class="verse">
是推荐系统的 <b>最重要指标</b><br/>
度量方法：购买率、反馈按钮、点击率、用户停留时间、转化率<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-3-2-2">预测准确度<br/>

<p class="verse">
推荐系统 <b>离线评测指标</b> 最重要的指标<br/>
</p>


<p>
     计算方法：
</p><ol>
<li>需要有一个离线的数据集，该数据集包含用户的历史行为记录
</li>
<li>将该数据集通过时间分成训练集和测试集
</li>
<li>在训练集上建立用户行为和兴趣模型预测用户在测试集上的行为
</li>
<li>计算预测行为和测试集上实际行为的重合度作为预测准确度
</li>
</ol>

<ul>
<li id="sec-1-3-2-2-1">评分预测<br/>
      均方根误差(RMSE) 平均绝对误差(MAE)
</li>
</ul>
<ul>
<li id="sec-1-3-2-2-2">TopN推荐(给用户一个个性化的推荐列表)<br/>
      准确率(precision) 召回率(recall)
</li>
</ul>
<ul>
<li id="sec-1-3-2-2-3">关于评分预测和TopN推荐的讨论<br/>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-3-2-3">覆盖率<br/>

<p class="verse">
覆盖率描述推荐系统对物品长尾的发掘能力<br/>
覆盖率是一个内容提供商会关心的指标<br/>
用信息熵和基尼系数两个指标来定义覆盖率<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-3-2-4">多样性<br/>

<p class="verse">
为了满足用户广泛的兴趣，推荐列表需要能够覆盖用户不同的兴趣领域，即推荐结果需要具有多样性<br/>
多样性描述了推荐列表中物品两两之间的不相似性，因此，多样性和相似性是对应的<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-3-2-5">新颖性<br/>

<p class="verse">
新颖性是指给用户推荐那些他们以前没有听过说的物品<br/>
实现新颖性的最简单办法是，把那些用户之前在网站中对其有过行为的物品从推荐列表中过滤掉<br/>
评测新颖度的最简单方法是利用推荐结果的平均流行度，因为越不热门的物品越可能让用户觉得新颖<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-3-2-6">惊喜度<br/>

<p class="verse">
