推荐系统实践.org
**** 惊喜度
     #+BEGIN_VERSE
     如果推荐结果和用户的历史兴趣不相似，但却让用户觉得满意，那么就可以说推荐结果的惊喜度很高，
     而推荐的新颖性仅仅取决于用户是否听说过这个推荐结果
     #+END_VERSE
**** 信任度
     提供推荐系统的信任度主要有两种方法：
     1. 需要增加推荐系统的透明度，而增加透明度的主要办法是提供推荐解释
     2. 考虑用户的社交网络信息，利用用户的好友信息给用户做推荐，并且用好友进行推荐解释
**** 实时性
     实时性包括两个方面：
     1. 需要实时地更新推荐列表来满足用户新的行为变化
     2. 需要能够将新加入系统的物品推荐给用户
**** 健壮性
     #+BEGIN_VERSE
     算法健壮性的评测主要利用模拟攻击
     设计推荐系统时尽量使用代价比较高的用户行为
     在使用数据前，进行攻击检测，从而对数据进行清理
     #+END_VERSE
**** 商业指标
**** 总结
     在给定覆盖率、多样性、新颖性等限制条件下，尽量优化预测准确度(作者看法)
*** 评测维度
    增加评测维度的目的就是知道一个算法在什么情况下性能最好

    评测维度分为如下3种
    1. 用户维度
    2. 物品维度
    3. 时间维度
* 第2章 利用用户行为数据
  基于用户行为分析的推荐算法也称为协同过滤算法
** 用户行为数据简介
   #+BEGIN_VERSE
   用户行为数据在网站上最简单的存在形式就是日志
   用户行为一般分两种：
   1. 显性反馈行为：用户明确表示对物品喜好的行为
   2. 隐性反馈行为：不能明确反应用户喜好的行为
   #+END_VERSE
   | user id           | 产生行为的用户的唯一标识                                                                         |
   | item id           | 产生行为的对象的唯一标识                                                                         |
   | behaviour type    | 行为的种类(比如是购买还是浏览)                                                                   |
   | context           | 产生行为的上下文，包括时间和地点等                                                               |
   | behaviour weight  | 行为的权重(如果是观看视频的行为，那么这个权重可以是观看时长；如果是打分行为，这个权重可以是分数) |
   | behaviour content | 行为的内容(如果是评论行为，那么就是评论的文本；如果是打标签的行为，就是标签)                     |
** 用户行为分析
*** 用户活跃度和物品流行度的分布
    长尾分布
*** 用户活跃度和物品流行度的关系
    用户越活跃，越倾向于浏览冷门的物品
** 实验设计和算法评测
*** 数据集
*** 实验设计
    1. 将用户行为数据集按照均匀分布随机分成M份，挑选一份作为测试集，将剩下的M-1份作为训练集
    2. 在训练集上建立用户兴趣模型，并在测试集上对用户行为进行预测，统计出相应的评测指标
    3. 为了保证评测指标并不是过拟合的结果，需要进行M次实验，并且每次都使用不同的测试集
    4. 将M次实验测出的评测指标的平均值作为最终的评测指标
*** 评测指标
    #+BEGIN_VERSE
    召回率描述有多少比例的用户-物品评分记录包含在最终的推荐列表中
    准确率描述最终的推荐列表中有多少比例是发生过的用户-物品评分记录
    覆盖率越高，说明推荐算法越能够将长尾中的物品推荐给用户
    #+END_VERSE
** 基于邻域的算法
*** 基于用户的协同过滤算法
**** 基础算法
     步骤：
     1. 找到和目标用户兴趣相似的用户集合(关键：计算两个用户的兴趣相似度)
     2. 找到这个集合中的用户喜欢的，且目标用户没有听说过的物品推荐给目标用户

     参数K(和user兴趣最相似的K个用户)是UserCF的一个重要参数，它的调整对推荐算法的各种指标都会产生一定的影响
**** 用户相似度计算的改进
     两个用户对冷门物品采取过同样的行为更能说明他们兴趣的相似度
**** 实际在线系统使用UserCF的例子
     最著名的使用者是Digg
*** 基于物品的协同过滤算法
**** 基础算法
     UserCF的缺点：     
     1. 运算时间复杂度和空间复杂度的增长和用户数的增长近似与平方关系
     2. 很难对推荐结果作出解释

     步骤：
     1. 计算物品之间的相似度
     2. 根据物品的相似度和用户的历史行为给用户生成推荐列表

     在协同过滤中两个物品产生相似度是因为它们共同被很多用户喜欢，也就是说每个用户都可以通过他们的历史兴趣列表给物品“贡献”相似度

     ItemCF的一个优势是可以提供推荐解释，即利用用户历史上喜欢的物品为现在的推荐结果进行解释
**** 用户活跃度对物品相似度的影响
     John S.Breese认为活跃用户对物品相似度的贡献应该小于不活跃的用户
**** 物品相似度的归一化
     归一化的好处不仅仅在于增加推荐的准确度，它还以提高推荐的覆盖率和多样性
*** UserCF和ItemCF的综合比较
    UserCF的推荐结果着重于反映和用户兴趣相似的小群体的热点，而ItemCF的推荐结果着重于维护用户的历史兴趣。
    换句话说，UserCF的推荐更社会化，反映了用户所在的小型兴趣群体中物品的热门程度，而ItemCF的推荐更加个性化，反映了用户自己的兴趣传承
    |      | UserCF                                                         | ItemCF                                                                           |
    | 性能 | 适用于用户较少的场合，如果用户很多，计算用户相似度矩阵代价很大 | 适用于物品数明显小于用户数的场合，如果物品很多(网页)，计算无平相似度矩阵代价很大 |
    | 领域 | 时效性较强，用户个性化兴趣不太明显的领域                       | 长尾物品丰富，用户个性化需求强烈的领域                                           |
    | 实时性 | 用户有新行为，不一定造成推荐结果的立即变化                     | 用户有新行为，一定会导致推荐结果的实时变化                                       |
    | 冷启动 | 1. 在新用户对很少的物品产生行为后，不能立即对他进行个性化推荐，因为用户相似度表是每隔一段时间离线计算的 | 1. 新用户只要对一个物品产生行为，就可以给他推荐和该物品相关的其他物品            |
    |        | 2. 新物品上线一段时间，一旦有用户对物品产生行为，就可以将新物品推荐给和对它产生行为的用户兴趣相似的其他用户 | 2. 没有办法在不离线更新物品相似度表的情况下将新物品推荐给用户                    |
    | 推荐理由 | 很难提供令用户信服的推荐解释                                                                                | 利用用户的历史行为给用户做推荐解释，可以令用户比较信服                           |
**** 哈利波特问题
     两个不同领域的最热门物品之间往往具有比较高的相似度
** 隐语义模型   
*** 基础算法
    它的核心思想是通过隐含特征(latent factor)联系用户兴趣和物品

    隐含语义分析技术采取基于用户行为统计的自动聚类
*** 基于LFM的实际系统的例子
    雅虎首页个性化

    LFM模型在实际使用中有一个困难，那就是它很难实现实时的推荐
*** LFM和基于邻域的方法的比较
    1. 理论基础
    2. 离线计算的空间复杂度
    3. 离线计算的时间复杂度
    4. 在线实时推荐
    5. 推荐解释
** 基于图的模型
*** 用户行为数据的二分图表示
*** 基于图的推荐算法
    如果将个性化推荐算法放到二分图模型上，那么给用户u推荐物品的任务就可以转化为度量用户顶点V_{u}和与V_{u}没有边直接相连的物品节点在图上的相关性，
    相关性越高的物品在推荐列表中的权重就越高

    图中顶点的相关性主要取决于3个因素：
    1. 两个顶点之间的路径数
    2. 两个顶点之间路径的长度
    3. 两个顶点之间的路径经过的顶点

    相关性高的一对顶点一般具有如下特征：
    1. 两个顶点之间有很多路径相连
    2. 连接两个顶点之间的路径长度都比较短
    3. 连接两个顶点之间的路径不会经过出度比较大的顶点
* 第3章 推荐系统冷启动问题
  冷启动问题：如何在没有大量用户数据的情况下设计个性化推荐系统并且让用户满意
** 冷启动问题简介
   主要分3类：
   1. 用户冷启动
   2. 物品冷启动
   3. 系统冷启动
** 利用用户注册信息
   用户的注册信息分3种：
   1. 人口统计学信息
   2. 用户兴趣的描述
   3. 从其他网站导入的用户站外行为数据

   基于注册信息的个性化推荐流程：
   1. 获取用户的注册信息
   2. 根据用户的注册信息对用户分类
   3. 给用户推荐他所属分类中用户喜欢的物品
** 选择合适的物品启动用户的兴趣
   能够用来启动用户兴趣的物品有如下特点：
   1. 比较热门
   2. 具有代表性和区分性
   3. 启动物品集合需要有多样性
** 利用物品的内容信息
   物品的内容可以通过向量空间模型表示，该模型会将物品表示成一个关键词向量

   如何建立文章、话题和关键词的关系是话题模型(topic model)研究的重点
** 发挥专家的作用
* 第4章 利用用户标签数据
  3种方式联系用户兴趣和物品：
  1. 利用用户喜欢过的物品
  2. 利用和用户兴趣相似的其他用户
  3. 通过一些特征(属性集合、隐语义向量、标签)联系用户和物品
