推荐系统实践.html
如果推荐结果和用户的历史兴趣不相似，但却让用户觉得满意，那么就可以说推荐结果的惊喜度很高，<br/>
而推荐的新颖性仅仅取决于用户是否听说过这个推荐结果<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-3-2-7">信任度<br/>
     提供推荐系统的信任度主要有两种方法：
<ol>
<li>需要增加推荐系统的透明度，而增加透明度的主要办法是提供推荐解释
</li>
<li>考虑用户的社交网络信息，利用用户的好友信息给用户做推荐，并且用好友进行推荐解释
</li>
</ol>

</li>
</ul>
<ul>
<li id="sec-1-3-2-8">实时性<br/>
     实时性包括两个方面：
<ol>
<li>需要实时地更新推荐列表来满足用户新的行为变化
</li>
<li>需要能够将新加入系统的物品推荐给用户
</li>
</ol>

</li>
</ul>
<ul>
<li id="sec-1-3-2-9">健壮性<br/>

<p class="verse">
算法健壮性的评测主要利用模拟攻击<br/>
设计推荐系统时尽量使用代价比较高的用户行为<br/>
在使用数据前，进行攻击检测，从而对数据进行清理<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-3-2-10">商业指标<br/>
</li>
</ul>
<ul>
<li id="sec-1-3-2-11">总结<br/>
     在给定覆盖率、多样性、新颖性等限制条件下，尽量优化预测准确度(作者看法)
</li>
</ul>
</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> 评测维度</h4>
<div class="outline-text-4" id="text-1-3-3">

<p>    增加评测维度的目的就是知道一个算法在什么情况下性能最好
</p>
<p>
    评测维度分为如下3种
</p><ol>
<li>用户维度
</li>
<li>物品维度
</li>
<li>时间维度
</li>
</ol>

</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 第2章 利用用户行为数据</h2>
<div class="outline-text-2" id="text-2">

<p>  基于用户行为分析的推荐算法也称为协同过滤算法
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 用户行为数据简介</h3>
<div class="outline-text-3" id="text-2-1">


<p class="verse">
用户行为数据在网站上最简单的存在形式就是日志<br/>
用户行为一般分两种：<br/>
1. 显性反馈行为：用户明确表示对物品喜好的行为<br/>
2. 隐性反馈行为：不能明确反应用户喜好的行为<br/>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">user id</td><td class="left">产生行为的用户的唯一标识</td></tr>
<tr><td class="left">item id</td><td class="left">产生行为的对象的唯一标识</td></tr>
<tr><td class="left">behaviour type</td><td class="left">行为的种类(比如是购买还是浏览)</td></tr>
<tr><td class="left">context</td><td class="left">产生行为的上下文，包括时间和地点等</td></tr>
<tr><td class="left">behaviour weight</td><td class="left">行为的权重(如果是观看视频的行为，那么这个权重可以是观看时长；如果是打分行为，这个权重可以是分数)</td></tr>
<tr><td class="left">behaviour content</td><td class="left">行为的内容(如果是评论行为，那么就是评论的文本；如果是打标签的行为，就是标签)</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 用户行为分析</h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 用户活跃度和物品流行度的分布</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>    长尾分布
</p></div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> 用户活跃度和物品流行度的关系</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>    用户越活跃，越倾向于浏览冷门的物品
</p></div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 实验设计和算法评测</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 数据集</h4>
<div class="outline-text-4" id="text-2-3-1">

</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> 实验设计</h4>
<div class="outline-text-4" id="text-2-3-2">

<ol>
<li>将用户行为数据集按照均匀分布随机分成M份，挑选一份作为测试集，将剩下的M-1份作为训练集
</li>
<li>在训练集上建立用户兴趣模型，并在测试集上对用户行为进行预测，统计出相应的评测指标
</li>
<li>为了保证评测指标并不是过拟合的结果，需要进行M次实验，并且每次都使用不同的测试集
</li>
<li>将M次实验测出的评测指标的平均值作为最终的评测指标
</li>
</ol>

</div>

</div>

<div id="outline-container-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> 评测指标</h4>
<div class="outline-text-4" id="text-2-3-3">


<p class="verse">
召回率描述有多少比例的用户-物品评分记录包含在最终的推荐列表中<br/>
准确率描述最终的推荐列表中有多少比例是发生过的用户-物品评分记录<br/>
覆盖率越高，说明推荐算法越能够将长尾中的物品推荐给用户<br/>
</p>


</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 基于邻域的算法</h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> 基于用户的协同过滤算法</h4>
<div class="outline-text-4" id="text-2-4-1">

<ul>
<li id="sec-2-4-1-1">基础算法<br/>
     步骤：
<ol>
<li>找到和目标用户兴趣相似的用户集合(关键：计算两个用户的兴趣相似度)
</li>
<li>找到这个集合中的用户喜欢的，且目标用户没有听说过的物品推荐给目标用户
</li>
</ol>


<p>
     参数K(和user兴趣最相似的K个用户)是UserCF的一个重要参数，它的调整对推荐算法的各种指标都会产生一定的影响
</p></li>
</ul>
<ul>
<li id="sec-2-4-1-2">用户相似度计算的改进<br/>
     两个用户对冷门物品采取过同样的行为更能说明他们兴趣的相似度
</li>
</ul>
<ul>
<li id="sec-2-4-1-3">实际在线系统使用UserCF的例子<br/>
     最著名的使用者是Digg
</li>
</ul>
</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> 基于物品的协同过滤算法</h4>
<div class="outline-text-4" id="text-2-4-2">

<ul>
<li id="sec-2-4-2-1">基础算法<br/>
     UserCF的缺点：     
<ol>
<li>运算时间复杂度和空间复杂度的增长和用户数的增长近似与平方关系
</li>
<li>很难对推荐结果作出解释
</li>
</ol>


<p>
     步骤：
</p><ol>
<li>计算物品之间的相似度
</li>
<li>根据物品的相似度和用户的历史行为给用户生成推荐列表
</li>
</ol>


<p>
     在协同过滤中两个物品产生相似度是因为它们共同被很多用户喜欢，也就是说每个用户都可以通过他们的历史兴趣列表给物品“贡献”相似度
</p>
<p>
     ItemCF的一个优势是可以提供推荐解释，即利用用户历史上喜欢的物品为现在的推荐结果进行解释
</p></li>
</ul>
<ul>
<li id="sec-2-4-2-2">用户活跃度对物品相似度的影响<br/>
     John S.Breese认为活跃用户对物品相似度的贡献应该小于不活跃的用户
</li>
</ul>
<ul>
<li id="sec-2-4-2-3">物品相似度的归一化<br/>
     归一化的好处不仅仅在于增加推荐的准确度，它还以提高推荐的覆盖率和多样性
</li>
</ul>
</div>

</div>

<div id="outline-container-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> UserCF和ItemCF的综合比较</h4>
<div class="outline-text-4" id="text-2-4-3">

<p>    UserCF的推荐结果着重于反映和用户兴趣相似的小群体的热点，而ItemCF的推荐结果着重于维护用户的历史兴趣。
    换句话说，UserCF的推荐更社会化，反映了用户所在的小型兴趣群体中物品的热门程度，而ItemCF的推荐更加个性化，反映了用户自己的兴趣传承
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left"></td><td class="left">UserCF</td><td class="left">ItemCF</td></tr>
<tr><td class="left">性能</td><td class="left">适用于用户较少的场合，如果用户很多，计算用户相似度矩阵代价很大</td><td class="left">适用于物品数明显小于用户数的场合，如果物品很多(网页)，计算无平相似度矩阵代价很大</td></tr>
<tr><td class="left">领域</td><td class="left">时效性较强，用户个性化兴趣不太明显的领域</td><td class="left">长尾物品丰富，用户个性化需求强烈的领域</td></tr>
<tr><td class="left">实时性</td><td class="left">用户有新行为，不一定造成推荐结果的立即变化</td><td class="left">用户有新行为，一定会导致推荐结果的实时变化</td></tr>
<tr><td class="left">冷启动</td><td class="left">1. 在新用户对很少的物品产生行为后，不能立即对他进行个性化推荐，因为用户相似度表是每隔一段时间离线计算的</td><td class="left">1. 新用户只要对一个物品产生行为，就可以给他推荐和该物品相关的其他物品</td></tr>
<tr><td class="left"></td><td class="left">2. 新物品上线一段时间，一旦有用户对物品产生行为，就可以将新物品推荐给和对它产生行为的用户兴趣相似的其他用户</td><td class="left">2. 没有办法在不离线更新物品相似度表的情况下将新物品推荐给用户</td></tr>
<tr><td class="left">推荐理由</td><td class="left">很难提供令用户信服的推荐解释</td><td class="left">利用用户的历史行为给用户做推荐解释，可以令用户比较信服</td></tr>
</tbody>
</table>

<ul>
<li id="sec-2-4-3-1">哈利波特问题<br/>
     两个不同领域的最热门物品之间往往具有比较高的相似度
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 隐语义模型</h3>
<div class="outline-text-3" id="text-2-5">


</div>

<div id="outline-container-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> 基础算法</h4>
<div class="outline-text-4" id="text-2-5-1">

<p>    它的核心思想是通过隐含特征(latent factor)联系用户兴趣和物品
</p>
<p>
    隐含语义分析技术采取基于用户行为统计的自动聚类
</p></div>

</div>

<div id="outline-container-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> 基于LFM的实际系统的例子</h4>
<div class="outline-text-4" id="text-2-5-2">

<p>    雅虎首页个性化
</p>
<p>
    LFM模型在实际使用中有一个困难，那就是它很难实现实时的推荐
</p></div>

</div>

<div id="outline-container-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> LFM和基于邻域的方法的比较</h4>
<div class="outline-text-4" id="text-2-5-3">

<ol>
<li>理论基础
</li>
<li>离线计算的空间复杂度
</li>
<li>离线计算的时间复杂度
</li>
<li>在线实时推荐
</li>
<li>推荐解释
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 基于图的模型</h3>
<div class="outline-text-3" id="text-2-6">


</div>

<div id="outline-container-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> 用户行为数据的二分图表示</h4>
<div class="outline-text-4" id="text-2-6-1">

</div>

</div>

<div id="outline-container-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> 基于图的推荐算法</h4>
<div class="outline-text-4" id="text-2-6-2">

<p>    如果将个性化推荐算法放到二分图模型上，那么给用户u推荐物品的任务就可以转化为度量用户顶点V<sub>u</sub>和与V<sub>u</sub>没有边直接相连的物品节点在图上的相关性，
    相关性越高的物品在推荐列表中的权重就越高
</p>
<p>
    图中顶点的相关性主要取决于3个因素：
</p><ol>
<li>两个顶点之间的路径数
</li>
<li>两个顶点之间路径的长度
</li>
<li>两个顶点之间的路径经过的顶点
</li>
</ol>


<p>
    相关性高的一对顶点一般具有如下特征：
</p><ol>
<li>两个顶点之间有很多路径相连
</li>
<li>连接两个顶点之间的路径长度都比较短
</li>
<li>连接两个顶点之间的路径不会经过出度比较大的顶点
</li>
</ol>

</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 第3章 推荐系统冷启动问题</h2>
<div class="outline-text-2" id="text-3">

<p>  冷启动问题：如何在没有大量用户数据的情况下设计个性化推荐系统并且让用户满意
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 冷启动问题简介</h3>
<div class="outline-text-3" id="text-3-1">

<p>   主要分3类：
</p><ol>
<li>用户冷启动
</li>
<li>物品冷启动
</li>
<li>系统冷启动
</li>
</ol>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 利用用户注册信息</h3>
<div class="outline-text-3" id="text-3-2">

<p>   用户的注册信息分3种：
</p><ol>
<li>人口统计学信息
</li>
<li>用户兴趣的描述
</li>
<li>从其他网站导入的用户站外行为数据
</li>
</ol>


<p>
   基于注册信息的个性化推荐流程：
</p><ol>
<li>获取用户的注册信息
</li>
<li>根据用户的注册信息对用户分类
</li>
<li>给用户推荐他所属分类中用户喜欢的物品
</li>
</ol>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 选择合适的物品启动用户的兴趣</h3>
<div class="outline-text-3" id="text-3-3">

<p>   能够用来启动用户兴趣的物品有如下特点：
</p><ol>
<li>比较热门
</li>
<li>具有代表性和区分性
</li>
<li>启动物品集合需要有多样性
</li>
</ol>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 利用物品的内容信息</h3>
<div class="outline-text-3" id="text-3-4">

<p>   物品的内容可以通过向量空间模型表示，该模型会将物品表示成一个关键词向量
</p>
<p>
   如何建立文章、话题和关键词的关系是话题模型(topic model)研究的重点
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 发挥专家的作用</h3>
<div class="outline-text-3" id="text-3-5">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 第4章 利用用户标签数据</h2>
<div class="outline-text-2" id="text-4">

<p>  3种方式联系用户兴趣和物品：
</p><ol>
<li>利用用户喜欢过的物品
</li>
<li>利用和用户兴趣相似的其他用户
</li>
<li>通过一些特征(属性集合、隐语义向量、标签)联系用户和物品
</li>
</ol>


</div>
