推荐系统实践.org
** UGC标签系统的代表应用
   标签系统的最大优势在于可以发挥群体的智能，获得对物品内容信息比较准确的关键词描述
*** Delicious
*** CiteULike
*** Last.fm
*** 豆瓣
*** Hulu
** 标签系统中的推荐问题
   主要有两个：
   1. 如何利用用户打标签的行为为其 *推荐物品* (基于标签的推荐)
   2. 如何在用户给物品打标签时为其 *推荐适合该物品的标签* (标签推荐)
*** 用户为什么进行标注
*** 用户如何打标签
*** 用户打什么样的标签
    Delicious的标签种类：
    1. 表明物品是什么
    2. 表明物品的种类
    3. 表明谁拥有物品
    4. 表达用户的观点
    5. 用户相关的标签
    6. 用户的任务
** 基于标签的推荐系统
*** 实验设置
*** 一个最简单的算法
    1. 统计每个用户最常用的标签
    2. 对于每个标签，统计被打过这个标签次数最多的物品
    3. 对于每一个用户，首先找到他常用的标签，然后找到具有这些标签的最热门物品推荐给这个用户
*** 算法的改进
**** TF-IDF
     适当惩罚热门标签和热门物品，在增进推荐结果个性化的同时并不会降低推荐结果的离线精度
**** 数据稀疏性
     对标签集合做扩展

     标签扩展的本质是对每个标签找到和它相似的标签，也就是计算标签之间的相似度
**** 标签清理
     标签清理的另一个重要意义在于将标签作为推荐解释

     对标签的质量要求：
     1. 标签不能包含没有意义的停止词或者表示情绪的词
     2. 推荐解释里不能包含很多意义相同的词语

     标签清理方法：
     1. 去除词频很高的停止词
     2. 去除因词根不同造成的同义词
     3. 去除因分隔符造成的同义词
*** 基于图的推荐算法
*** 基于标签的推荐解释
    基于标签的最大好处是可以利用标签做推荐解释
** 给用户推荐标签
*** 为什么要给用户推荐标签
    1. 方便用户输入标签
    2. 提高标签质量
*** 如何给用户推荐标签
    1. popular_tags
    2. item_popular_tags
    3. user_popular_tags
    4. hybrid_popular_tags
*** 实验设置
*** 基于图的标签推荐算法
** 扩展阅读
* 第5章 利用上下文信息
** 时间上下文信息
*** 时间效应简介
    1. 用户兴趣是变化的
    2. 物品也是有生命周期的
    3. 季节效应
*** 时间效应举例
*** 系统时间特性的分析
    通过统计如下信息研究系统的时间特性：
    1. 每天独立用户数的增长情况
    2. 系统的物品变化情况
    3. 用户访问情况
**** 数据集的选择
**** 物品的生存周期和系统的时效性
     1. 物品平均在线天数

	如果一个物品在某天被至少一个用户产生过行为，就定义该物品在这一天在线。因此可以通过物品的平均在线天数度量一类物品的生存周期
     2. 相隔T天系统物品流行度向量的平均相似度
*** 推荐系统的实时性
    实现推荐系统的实时性除了对用户行为的存取有实时性要求，还要求推荐算法本身具有实时性
*** 推荐算法的时间多样性
    时间多样性：推荐系统每天推荐结果的变化程度

    如何在不损失精度的情况下提高推荐结果的时间多样性
    
    提高推荐结果的时间多样性需要分两步解决：
    1. 保证推荐系统能够在用户有了新的行为后及时调整推荐结果，使推荐结果满足用户最近的兴趣
    2. 保证推荐系统在用户没有新的行为时也能够经常变化一下结果，具有一定的时间多样性

    如果用户没有行为，保证给用户的推荐结果具有一定的时间多样性思路：
    1. 在生成推荐结果时加入一定的随机性
    2. 记录用户每天看到的推荐结果，然后在每天给用户进行推荐时，对他前几天看到过很多次的推荐结果进行适当地降权
    3. 每天给用户使用不同的推荐算法
*** 时间上下文推荐算法
    1. 最近最热门
    2. 时间上下文相关的ItemCF算法
    3. 时间上下文相关的UserCF算法
*** 时间段图模型
*** 离线实验
** 地点上下文信息
** 扩展阅读
* 第6章 利用社交网络数据 
** 获取社交网络数据的途径
*** 电子邮件
*** 用户注册信息
*** 用户的位置数据
*** 论坛和讨论组
*** 即使聊天工具
*** 社交网站
    社交网站的另一个好处是自然地减轻了信息过载问题

    社交图谱(Facebook) 兴趣图谱(twitter)
** 社交网络数据简介
   #+BEGIN_VERSE
   在Facebook这种社交网络上可以用 *无向边* 连接有社交网络关系的用户
   在twitter上可以用 *有向边* 代表社交网络上的用户关系
   #+END_VERSE
   3种不同的社交网络数据：
   1. 双向确认的社交网络数据
   2. 单向关注的社交网络数据
   3. 基于社区的社交网络数据
** 基于社交网络的推荐
   社会化推荐优点：
   1. 好友推荐可以增加推荐的信任度
   2. 社交网络可以解决冷启动问题

   缺点：很多时候并不一定能提高推荐算法的离线精度(准确率和召回率)
*** 基于邻域的社会化推荐算法
    最简单的算法是给用户推荐好友喜欢的物品集合

    熟悉度可以用用户之间的共同好友比例来度量
*** 基于图的社会化推荐算法
*** 实际系统中的社会化推荐算法
*** 社会化推荐系统和协同过滤推荐系统
    社会化推荐的优势不在于增加预测准确度，而是在于通过用户的好友增加用户对推荐结果的信任度，从而让用户单击那些很冷门的推荐结果
*** 信息流推荐
    信息流的个性化推荐要解决的问题就是如何进一步帮助用户从信息墙上挑选有用的信息
** 给用户推荐好友
   好友推荐系统的目的是根据用户现有的好友、用户的行为记录给用户推荐新的好友，从而增加整个社交网络的稠密程度和社交网站用户的活跃度
*** 基于内容的匹配
    1. 用户人口统计学属性
    2. 用户的兴趣
    3. 用户的位置信息
*** 基于共同兴趣的好友推荐
*** 基于社交网络图的好友推荐
    #+BEGIN_VERSE
    w_{out}
    w_{in}
    w_{out,in}
    w'_{out, in}
    #+END_VERSE      
