推荐系统实践.html

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> UGC标签系统的代表应用</h3>
<div class="outline-text-3" id="text-4-1">

<p>   标签系统的最大优势在于可以发挥群体的智能，获得对物品内容信息比较准确的关键词描述
</p>
</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Delicious</h4>
<div class="outline-text-4" id="text-4-1-1">

</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> CiteULike</h4>
<div class="outline-text-4" id="text-4-1-2">

</div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Last.fm</h4>
<div class="outline-text-4" id="text-4-1-3">

</div>

</div>

<div id="outline-container-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> 豆瓣</h4>
<div class="outline-text-4" id="text-4-1-4">

</div>

</div>

<div id="outline-container-4-1-5" class="outline-4">
<h4 id="sec-4-1-5"><span class="section-number-4">4.1.5</span> Hulu</h4>
<div class="outline-text-4" id="text-4-1-5">

</div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 标签系统中的推荐问题</h3>
<div class="outline-text-3" id="text-4-2">

<p>   主要有两个：
</p><ol>
<li>如何利用用户打标签的行为为其 <b>推荐物品</b> (基于标签的推荐)
</li>
<li>如何在用户给物品打标签时为其 <b>推荐适合该物品的标签</b> (标签推荐)
</li>
</ol>


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> 用户为什么进行标注</h4>
<div class="outline-text-4" id="text-4-2-1">

</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> 用户如何打标签</h4>
<div class="outline-text-4" id="text-4-2-2">

</div>

</div>

<div id="outline-container-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> 用户打什么样的标签</h4>
<div class="outline-text-4" id="text-4-2-3">

<p>    Delicious的标签种类：
</p><ol>
<li>表明物品是什么
</li>
<li>表明物品的种类
</li>
<li>表明谁拥有物品
</li>
<li>表达用户的观点
</li>
<li>用户相关的标签
</li>
<li>用户的任务
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 基于标签的推荐系统</h3>
<div class="outline-text-3" id="text-4-3">


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> 实验设置</h4>
<div class="outline-text-4" id="text-4-3-1">

</div>

</div>

<div id="outline-container-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> 一个最简单的算法</h4>
<div class="outline-text-4" id="text-4-3-2">

<ol>
<li>统计每个用户最常用的标签
</li>
<li>对于每个标签，统计被打过这个标签次数最多的物品
</li>
<li>对于每一个用户，首先找到他常用的标签，然后找到具有这些标签的最热门物品推荐给这个用户
</li>
</ol>

</div>

</div>

<div id="outline-container-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> 算法的改进</h4>
<div class="outline-text-4" id="text-4-3-3">

<ul>
<li id="sec-4-3-3-1">TF-IDF<br/>
     适当惩罚热门标签和热门物品，在增进推荐结果个性化的同时并不会降低推荐结果的离线精度
</li>
</ul>
<ul>
<li id="sec-4-3-3-2">数据稀疏性<br/>
     对标签集合做扩展

<p>
     标签扩展的本质是对每个标签找到和它相似的标签，也就是计算标签之间的相似度
</p></li>
</ul>
<ul>
<li id="sec-4-3-3-3">标签清理<br/>
     标签清理的另一个重要意义在于将标签作为推荐解释

<p>
     对标签的质量要求：
</p><ol>
<li>标签不能包含没有意义的停止词或者表示情绪的词
</li>
<li>推荐解释里不能包含很多意义相同的词语
</li>
</ol>


<p>
     标签清理方法：
</p><ol>
<li>去除词频很高的停止词
</li>
<li>去除因词根不同造成的同义词
</li>
<li>去除因分隔符造成的同义词
</li>
</ol>

</li>
</ul>
</div>

</div>

<div id="outline-container-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> 基于图的推荐算法</h4>
<div class="outline-text-4" id="text-4-3-4">

</div>

</div>

<div id="outline-container-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> 基于标签的推荐解释</h4>
<div class="outline-text-4" id="text-4-3-5">

<p>    基于标签的最大好处是可以利用标签做推荐解释
</p></div>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 给用户推荐标签</h3>
<div class="outline-text-3" id="text-4-4">


</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> 为什么要给用户推荐标签</h4>
<div class="outline-text-4" id="text-4-4-1">

<ol>
<li>方便用户输入标签
</li>
<li>提高标签质量
</li>
</ol>

</div>

</div>

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> 如何给用户推荐标签</h4>
<div class="outline-text-4" id="text-4-4-2">

<ol>
<li>popular_tags
</li>
<li>item_popular_tags
</li>
<li>user_popular_tags
</li>
<li>hybrid_popular_tags
</li>
</ol>

</div>

</div>

<div id="outline-container-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> 实验设置</h4>
<div class="outline-text-4" id="text-4-4-3">

</div>

</div>

<div id="outline-container-4-4-4" class="outline-4">
<h4 id="sec-4-4-4"><span class="section-number-4">4.4.4</span> 基于图的标签推荐算法</h4>
<div class="outline-text-4" id="text-4-4-4">

</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 扩展阅读</h3>
<div class="outline-text-3" id="text-4-5">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 第5章 利用上下文信息</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 时间上下文信息</h3>
<div class="outline-text-3" id="text-5-1">


</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> 时间效应简介</h4>
<div class="outline-text-4" id="text-5-1-1">

<ol>
<li>用户兴趣是变化的
</li>
<li>物品也是有生命周期的
</li>
<li>季节效应
</li>
</ol>

</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> 时间效应举例</h4>
<div class="outline-text-4" id="text-5-1-2">

</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> 系统时间特性的分析</h4>
<div class="outline-text-4" id="text-5-1-3">

<p>    通过统计如下信息研究系统的时间特性：
</p><ol>
<li>每天独立用户数的增长情况
</li>
<li>系统的物品变化情况
</li>
<li>用户访问情况
</li>
</ol>

<ul>
<li id="sec-5-1-3-1">数据集的选择<br/>
</li>
</ul>
<ul>
<li id="sec-5-1-3-2">物品的生存周期和系统的时效性<br/>
<ol>
<li>物品平均在线天数

<p>
        如果一个物品在某天被至少一个用户产生过行为，就定义该物品在这一天在线。因此可以通过物品的平均在线天数度量一类物品的生存周期
</p></li>
<li>相隔T天系统物品流行度向量的平均相似度
</li>
</ol>

</li>
</ul>
</div>

</div>

<div id="outline-container-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="section-number-4">5.1.4</span> 推荐系统的实时性</h4>
<div class="outline-text-4" id="text-5-1-4">

<p>    实现推荐系统的实时性除了对用户行为的存取有实时性要求，还要求推荐算法本身具有实时性
</p></div>

</div>

<div id="outline-container-5-1-5" class="outline-4">
<h4 id="sec-5-1-5"><span class="section-number-4">5.1.5</span> 推荐算法的时间多样性</h4>
<div class="outline-text-4" id="text-5-1-5">

<p>    时间多样性：推荐系统每天推荐结果的变化程度
</p>
<p>
    如何在不损失精度的情况下提高推荐结果的时间多样性
</p>
<p>    
    提高推荐结果的时间多样性需要分两步解决：
</p><ol>
<li>保证推荐系统能够在用户有了新的行为后及时调整推荐结果，使推荐结果满足用户最近的兴趣
</li>
<li>保证推荐系统在用户没有新的行为时也能够经常变化一下结果，具有一定的时间多样性
</li>
</ol>


<p>
    如果用户没有行为，保证给用户的推荐结果具有一定的时间多样性思路：
</p><ol>
<li>在生成推荐结果时加入一定的随机性
</li>
<li>记录用户每天看到的推荐结果，然后在每天给用户进行推荐时，对他前几天看到过很多次的推荐结果进行适当地降权
</li>
<li>每天给用户使用不同的推荐算法
</li>
</ol>

</div>

</div>

<div id="outline-container-5-1-6" class="outline-4">
<h4 id="sec-5-1-6"><span class="section-number-4">5.1.6</span> 时间上下文推荐算法</h4>
<div class="outline-text-4" id="text-5-1-6">

<ol>
<li>最近最热门
</li>
<li>时间上下文相关的ItemCF算法
</li>
<li>时间上下文相关的UserCF算法
</li>
</ol>

</div>

</div>

<div id="outline-container-5-1-7" class="outline-4">
<h4 id="sec-5-1-7"><span class="section-number-4">5.1.7</span> 时间段图模型</h4>
<div class="outline-text-4" id="text-5-1-7">

</div>

</div>

<div id="outline-container-5-1-8" class="outline-4">
<h4 id="sec-5-1-8"><span class="section-number-4">5.1.8</span> 离线实验</h4>
<div class="outline-text-4" id="text-5-1-8">

</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 地点上下文信息</h3>
<div class="outline-text-3" id="text-5-2">

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 扩展阅读</h3>
<div class="outline-text-3" id="text-5-3">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 第6章 利用社交网络数据</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 获取社交网络数据的途径</h3>
<div class="outline-text-3" id="text-6-1">


</div>

<div id="outline-container-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> 电子邮件</h4>
<div class="outline-text-4" id="text-6-1-1">

</div>

</div>

<div id="outline-container-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> 用户注册信息</h4>
<div class="outline-text-4" id="text-6-1-2">

</div>

</div>

<div id="outline-container-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> 用户的位置数据</h4>
<div class="outline-text-4" id="text-6-1-3">

</div>

</div>

<div id="outline-container-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> 论坛和讨论组</h4>
<div class="outline-text-4" id="text-6-1-4">

</div>

</div>

<div id="outline-container-6-1-5" class="outline-4">
<h4 id="sec-6-1-5"><span class="section-number-4">6.1.5</span> 即使聊天工具</h4>
<div class="outline-text-4" id="text-6-1-5">

</div>

</div>

<div id="outline-container-6-1-6" class="outline-4">
<h4 id="sec-6-1-6"><span class="section-number-4">6.1.6</span> 社交网站</h4>
<div class="outline-text-4" id="text-6-1-6">

<p>    社交网站的另一个好处是自然地减轻了信息过载问题
</p>
<p>
    社交图谱(Facebook) 兴趣图谱(twitter)
</p></div>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 社交网络数据简介</h3>
<div class="outline-text-3" id="text-6-2">


<p class="verse">
在Facebook这种社交网络上可以用 <b>无向边</b> 连接有社交网络关系的用户<br/>
在twitter上可以用 <b>有向边</b> 代表社交网络上的用户关系<br/>
</p>


<p>
   3种不同的社交网络数据：
</p><ol>
<li>双向确认的社交网络数据
</li>
<li>单向关注的社交网络数据
</li>
<li>基于社区的社交网络数据
</li>
</ol>

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 基于社交网络的推荐</h3>
<div class="outline-text-3" id="text-6-3">

<p>   社会化推荐优点：
</p><ol>
<li>好友推荐可以增加推荐的信任度
</li>
<li>社交网络可以解决冷启动问题
</li>
</ol>


<p>
   缺点：很多时候并不一定能提高推荐算法的离线精度(准确率和召回率)
</p>
</div>

<div id="outline-container-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> 基于邻域的社会化推荐算法</h4>
<div class="outline-text-4" id="text-6-3-1">

<p>    最简单的算法是给用户推荐好友喜欢的物品集合
</p>
<p>
    熟悉度可以用用户之间的共同好友比例来度量
</p></div>

</div>

<div id="outline-container-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> 基于图的社会化推荐算法</h4>
<div class="outline-text-4" id="text-6-3-2">

</div>

</div>

<div id="outline-container-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> 实际系统中的社会化推荐算法</h4>
<div class="outline-text-4" id="text-6-3-3">

</div>

</div>

<div id="outline-container-6-3-4" class="outline-4">
<h4 id="sec-6-3-4"><span class="section-number-4">6.3.4</span> 社会化推荐系统和协同过滤推荐系统</h4>
<div class="outline-text-4" id="text-6-3-4">

<p>    社会化推荐的优势不在于增加预测准确度，而是在于通过用户的好友增加用户对推荐结果的信任度，从而让用户单击那些很冷门的推荐结果
</p></div>

</div>

<div id="outline-container-6-3-5" class="outline-4">
<h4 id="sec-6-3-5"><span class="section-number-4">6.3.5</span> 信息流推荐</h4>
<div class="outline-text-4" id="text-6-3-5">

<p>    信息流的个性化推荐要解决的问题就是如何进一步帮助用户从信息墙上挑选有用的信息
</p></div>
</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 给用户推荐好友</h3>
<div class="outline-text-3" id="text-6-4">

<p>   好友推荐系统的目的是根据用户现有的好友、用户的行为记录给用户推荐新的好友，从而增加整个社交网络的稠密程度和社交网站用户的活跃度
</p>
</div>
