推荐系统实践.org
*** 基于用户调查的好友推荐算法对比
** 扩展阅读
   *六度原理*

   很多对社交网络的研究都是基于 *随机图理论* 的

   社交网络研究中两个最著名的问题：
   1. 如何度量人的重要性，即社交网络顶点的中心度
   2. 如何度量社交网络中人和人之间的关系，即链接预测
* 第7章 推荐系统实例
** 外围架构
   如何存取用户行为数据是推荐系统需要解决的首要问题

   需要实时存取的数据存储在数据库和缓存中，而大规模的非实时地存取数据存储在分布式文件系统中
** 推荐系统架构
   基于特征的推荐系统架构的核心任务有两部分：
   1. 如何为给定用户生成特征
   2. 如何根据特征找到物品

   特征种类：
   1. 人口统计学特征
   2. 用户的行为特征
   3. 用户的话题特征

   如果把各种特征和任务都统筹考虑，则推荐系统将会非常复杂，而且很难通过配置文件方便地配置不同特征和任务的权重。
   因此，推荐系统需要由多个推荐引擎组成，每个推荐引擎负责一类特征和一种任务，而推荐系统的任务只是将推荐引擎的结果按照一定权重或者优先级合并、排序然后返回

   使用推荐引擎的好处：
   1. 可以方便地增加/删除引擎，控制不同引擎对推荐结果的影响
   2. 可以实现推荐引擎级别的用户反馈
** 推荐引擎的架构
*** 生成用户特征向量
    一个特征向量由特征以及特征的权重组成，在利用用户行为计算特征向量时需要考虑以下因素：
    1. 用户行为的种类
       一般的标准就是用户付出代价越大的行为权重越高
    2. 用户行为产生的时间
    3. 用户行为的次数
    4. 物品的热门程度
*** 特征-物品相关推荐
*** 过滤模块
    1. 用户已经产生过行为的物品
    2. 候选物品以外的物品
    3. 某些质量很差的物品
*** 排名模块
**** 新颖性排名
**** 多样性
     提高多样性的方法：
     1. 将推荐结果按照某种物品的内容属性分成几类，然后在某个类中都选择该类中排名最高的物品组合成最终的推荐列表
     2. 让推荐结果尽量来自不同的特征，具有不同的推荐理由，而不是所有的推荐结果都对应一个理由
**** 时间多样性
**** 用户反馈
     是排名模块最重要的部分
** 扩展阅读
* 第8章 评分预测问题
  评分预测问题就是如何通过已知的用户历史评分记录预测未知的用户评分记录
** 离线实验方法
** 评分预测算法
*** 平均值
**** 全局平均值
**** 用户评分平均值
**** 物品评分平均值
**** 用户分类对物品分类的平均值
*** 基于邻域的方法
*** 隐语义模型与矩阵分解模型
    在推荐系统邻域，提的最多的就是隐语义模型和矩阵分解模型。其实，这两个名词说的是一回事，就是如何通过降维的方法将评分矩阵补全
**** 传统的SVD分解
     对矩阵扰动最小：如果补全后矩阵的特征值和补全之前矩阵的特征值相差不大，就算是扰动比较小

     最早的矩阵分解模型就是从数学上的SVD(奇异值分解)开始的
**** Simon Funk的SVD分解
**** 加入偏置项后的LFM
**** 考虑邻域影响的LFM
*** 加入时间信息
**** 基于邻域的模型融合时间信息
**** 基于矩阵分解的模型融合时间信息
*** 模型融合
**** 模型级联融合
**** 模型加权融合
*** Netflix Prize的相关实验结果
