推荐系统实践.html

<div id="outline-container-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> 基于内容的匹配</h4>
<div class="outline-text-4" id="text-6-4-1">

<ol>
<li>用户人口统计学属性
</li>
<li>用户的兴趣
</li>
<li>用户的位置信息
</li>
</ol>

</div>

</div>

<div id="outline-container-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> 基于共同兴趣的好友推荐</h4>
<div class="outline-text-4" id="text-6-4-2">

</div>

</div>

<div id="outline-container-6-4-3" class="outline-4">
<h4 id="sec-6-4-3"><span class="section-number-4">6.4.3</span> 基于社交网络图的好友推荐</h4>
<div class="outline-text-4" id="text-6-4-3">


<p class="verse">
w<sub>out</sub><br/>
w<sub>in</sub><br/>
w<sub>out,in</sub><br/>
w'<sub>out, in</sub><br/>
</p>


</div>

</div>

<div id="outline-container-6-4-4" class="outline-4">
<h4 id="sec-6-4-4"><span class="section-number-4">6.4.4</span> 基于用户调查的好友推荐算法对比</h4>
<div class="outline-text-4" id="text-6-4-4">

</div>
</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 扩展阅读</h3>
<div class="outline-text-3" id="text-6-5">

<p>   <b>六度原理</b>
</p>
<p>
   很多对社交网络的研究都是基于 <b>随机图理论</b> 的
</p>
<p>
   社交网络研究中两个最著名的问题：
</p><ol>
<li>如何度量人的重要性，即社交网络顶点的中心度
</li>
<li>如何度量社交网络中人和人之间的关系，即链接预测
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 第7章 推荐系统实例</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 外围架构</h3>
<div class="outline-text-3" id="text-7-1">

<p>   如何存取用户行为数据是推荐系统需要解决的首要问题
</p>
<p>
   需要实时存取的数据存储在数据库和缓存中，而大规模的非实时地存取数据存储在分布式文件系统中
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 推荐系统架构</h3>
<div class="outline-text-3" id="text-7-2">

<p>   基于特征的推荐系统架构的核心任务有两部分：
</p><ol>
<li>如何为给定用户生成特征
</li>
<li>如何根据特征找到物品
</li>
</ol>


<p>
   特征种类：
</p><ol>
<li>人口统计学特征
</li>
<li>用户的行为特征
</li>
<li>用户的话题特征
</li>
</ol>


<p>
   如果把各种特征和任务都统筹考虑，则推荐系统将会非常复杂，而且很难通过配置文件方便地配置不同特征和任务的权重。
   因此，推荐系统需要由多个推荐引擎组成，每个推荐引擎负责一类特征和一种任务，而推荐系统的任务只是将推荐引擎的结果按照一定权重或者优先级合并、排序然后返回
</p>
<p>
   使用推荐引擎的好处：
</p><ol>
<li>可以方便地增加/删除引擎，控制不同引擎对推荐结果的影响
</li>
<li>可以实现推荐引擎级别的用户反馈
</li>
</ol>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 推荐引擎的架构</h3>
<div class="outline-text-3" id="text-7-3">


</div>

<div id="outline-container-7-3-1" class="outline-4">
<h4 id="sec-7-3-1"><span class="section-number-4">7.3.1</span> 生成用户特征向量</h4>
<div class="outline-text-4" id="text-7-3-1">

<p>    一个特征向量由特征以及特征的权重组成，在利用用户行为计算特征向量时需要考虑以下因素：
</p><ol>
<li>用户行为的种类
       一般的标准就是用户付出代价越大的行为权重越高
</li>
<li>用户行为产生的时间
</li>
<li>用户行为的次数
</li>
<li>物品的热门程度
</li>
</ol>

</div>

</div>

<div id="outline-container-7-3-2" class="outline-4">
<h4 id="sec-7-3-2"><span class="section-number-4">7.3.2</span> 特征-物品相关推荐</h4>
<div class="outline-text-4" id="text-7-3-2">

</div>

</div>

<div id="outline-container-7-3-3" class="outline-4">
<h4 id="sec-7-3-3"><span class="section-number-4">7.3.3</span> 过滤模块</h4>
<div class="outline-text-4" id="text-7-3-3">

<ol>
<li>用户已经产生过行为的物品
</li>
<li>候选物品以外的物品
</li>
<li>某些质量很差的物品
</li>
</ol>

</div>

</div>

<div id="outline-container-7-3-4" class="outline-4">
<h4 id="sec-7-3-4"><span class="section-number-4">7.3.4</span> 排名模块</h4>
<div class="outline-text-4" id="text-7-3-4">

<ul>
<li id="sec-7-3-4-1">新颖性排名<br/>
</li>
</ul>
<ul>
<li id="sec-7-3-4-2">多样性<br/>
     提高多样性的方法：
<ol>
<li>将推荐结果按照某种物品的内容属性分成几类，然后在某个类中都选择该类中排名最高的物品组合成最终的推荐列表
</li>
<li>让推荐结果尽量来自不同的特征，具有不同的推荐理由，而不是所有的推荐结果都对应一个理由
</li>
</ol>

</li>
</ul>
<ul>
<li id="sec-7-3-4-3">时间多样性<br/>
</li>
</ul>
<ul>
<li id="sec-7-3-4-4">用户反馈<br/>
     是排名模块最重要的部分
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 扩展阅读</h3>
<div class="outline-text-3" id="text-7-4">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 第8章 评分预测问题</h2>
<div class="outline-text-2" id="text-8">

<p>  评分预测问题就是如何通过已知的用户历史评分记录预测未知的用户评分记录
</p>
</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 离线实验方法</h3>
<div class="outline-text-3" id="text-8-1">

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 评分预测算法</h3>
<div class="outline-text-3" id="text-8-2">


</div>

<div id="outline-container-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> 平均值</h4>
<div class="outline-text-4" id="text-8-2-1">

<ul>
<li id="sec-8-2-1-1">全局平均值<br/>
</li>
</ul>
<ul>
<li id="sec-8-2-1-2">用户评分平均值<br/>
</li>
</ul>
<ul>
<li id="sec-8-2-1-3">物品评分平均值<br/>
</li>
</ul>
<ul>
<li id="sec-8-2-1-4">用户分类对物品分类的平均值<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> 基于邻域的方法</h4>
<div class="outline-text-4" id="text-8-2-2">

</div>

</div>

<div id="outline-container-8-2-3" class="outline-4">
<h4 id="sec-8-2-3"><span class="section-number-4">8.2.3</span> 隐语义模型与矩阵分解模型</h4>
<div class="outline-text-4" id="text-8-2-3">

<p>    在推荐系统邻域，提的最多的就是隐语义模型和矩阵分解模型。其实，这两个名词说的是一回事，就是如何通过降维的方法将评分矩阵补全
</p><ul>
<li id="sec-8-2-3-1">传统的SVD分解<br/>
     对矩阵扰动最小：如果补全后矩阵的特征值和补全之前矩阵的特征值相差不大，就算是扰动比较小

<p>
     最早的矩阵分解模型就是从数学上的SVD(奇异值分解)开始的
</p></li>
</ul>
<ul>
<li id="sec-8-2-3-2">Simon Funk的SVD分解<br/>
</li>
</ul>
<ul>
<li id="sec-8-2-3-3">加入偏置项后的LFM<br/>
</li>
</ul>
<ul>
<li id="sec-8-2-3-4">考虑邻域影响的LFM<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-8-2-4" class="outline-4">
<h4 id="sec-8-2-4"><span class="section-number-4">8.2.4</span> 加入时间信息</h4>
<div class="outline-text-4" id="text-8-2-4">

<ul>
<li id="sec-8-2-4-1">基于邻域的模型融合时间信息<br/>
</li>
</ul>
<ul>
<li id="sec-8-2-4-2">基于矩阵分解的模型融合时间信息<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-8-2-5" class="outline-4">
<h4 id="sec-8-2-5"><span class="section-number-4">8.2.5</span> 模型融合</h4>
<div class="outline-text-4" id="text-8-2-5">

<ul>
<li id="sec-8-2-5-1">模型级联融合<br/>
</li>
</ul>
<ul>
<li id="sec-8-2-5-2">模型加权融合<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-8-2-6" class="outline-4">
<h4 id="sec-8-2-6"><span class="section-number-4">8.2.6</span> Netflix Prize的相关实验结果</h4>
<div class="outline-text-4" id="text-8-2-6">

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-31 20:40:18 CST</p>
<p class="author">Author: wyj</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
